package S19_inheritance;
/*Java Inheritance (জাভা ইনহেরিটেন্স)

👉 Inheritance হলো Object Oriented Programming (OOP)-এর একটি গুরুত্বপূর্ণ ফিচার। এর মাধ্যমে একটি ক্লাস (child class / subclass) আরেকটি ক্লাসের (parent class / superclass) প্রপার্টি (fields, variables) এবং মেথড (methods) উত্তরাধিকার সূত্রে পায়।

কেন Inheritance ব্যবহার করা হয়?

Code Reusability (কোড পুনঃব্যবহার) → একবার parent class এ লিখে child class এ reuse করা যায়।

Method Overriding সম্ভব হয় → child class তার নিজের মতো করে parent এর মেথড modify করতে পারে।

Hierarchical Relationship তৈরি হয় → class গুলোকে সম্পর্কিতভাবে ব্যবহার করা যায়।

Inheritance এর Syntax

class Parent {
    // fields এবং methods
}

class Child extends Parent {
    // Parent class এর property use করা যাবে
}


👉 এখানে extends কীওয়ার্ড ব্যবহার করে inheritance করা হয়।*/



public class s1_inheritanceSyntax {

}
